app/controllers/school_classes_controller.rb

def create
    @school_class = SchoolClass.create(class_params)
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "lhcwlh"], ["room_number", 2]]